data/Parm_PH_29/alpha_10/alpha_10_6000_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.027533067843108 1.00078217893261 0)
(0.0825992071503881 1.00078161526609 0)
(0.137660125282601 0.999617865200604 0)
(0.192554459849542 0.995353021751943 9.57708525571882e-20)
(0.246877147522095 0.98654418488442 -2.14106635381073e-18)
(0.299934252111671 0.972055210523574 0)
(0.350949411108725 0.951507701659829 -2.1679786485729e-18)
(0.399606331910972 0.92580889276968 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0275380308287193 1 0)
(0.0826140843252403 0.999999435229031 0)
(0.137660661570098 0.998834429392629 0)
(0.192524645276771 0.994567469357484 0)
(0.246803698512525 0.985758700166011 0)
(0.299808778286068 0.971275266224766 0)
(0.350775555173464 0.950734915615479 0)
(0.399401814158756 0.925027846371397 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.025 2.024 0)
(0.075 2.024 0)
(0.125 2.024 0)
(0.175 2.024 0)
(0.225 2.024 0)
(0.275 2.024 0)
(0.325 2.024 0)
(0.375 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
