data/Parm_PH_29/alpha_10/alpha_10_6000_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.02229856 -0.00041885 0.00000000 0.00013020 0.00000000 0.01305437)
(0.02514978 -0.00051809 0.00000000 0.00016333 0.00000000 0.01489679)
(0.02141358 -0.00037550 0.00000000 0.00008111 0.00000000 0.01249591)
(0.00751360 -0.00007123 0.00000000 -0.00013284 0.00000000 0.00263772)
(0.00250275 -0.00029812 0.00000000 0.00004954 0.00000000 0.00250213)
(0.00314143 -0.00011213 0.00000000 0.00020008 0.00000000 0.00713584)
(0.00057087 -0.00067606 0.00000000 0.00051093 0.00000000 0.00221035)
(0.00256615 -0.00194192 0.00000000 0.00141057 0.00000000 0.00565542)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
